# 8640 Числа с нечетными цифрами
n=input().split()
b=int(n[0])
c=int(n[1])

for i in range(b,c+1):
    if (i//1000)!=0 and (i//1000)!=2 and (i//1000)!=4 and (i//1000)!=6 and (i//1000)!=8:
        if ((i//100)%10)!=0 and ((i//100)%10)!=2 and ((i//100)%10)!=4 and ((i//100)%10)!=6 and ((i//100)%10)!=8:
            if ((i%100)//10)!=0 and ((i%100)//10)!=2 and ((i%100)//10)!=4 and ((i%100)//10)!=6 and ((i%100)//10)!=8:
                if (i%10)!=0 and (i%10)!=2 and (i%10)!=4 and (i%10)!=6 and (i%10)!=8:
                    print(i, end=' ')
